vapix/onvif-request/app/initial-info-request/GetVideoSourceConfigurationOptions.xml

<!-- Endpoint: /vapix/services -->

<!-- Request: GetVideoSourceConfigurationOptions -->

<?xml version="1.0" encoding="UTF-8"?>
<Envelope xmlns="http://www.w3.org/2003/05/soap-envelope">
    <Header/>
    <Body>
        <GetVideoSourceConfigurationOptions xmlns="http://www.onvif.org/ver20/media/wsdl" />
    </Body>
</Envelope>
<!--  -->
<!-- Response: GetVideoSourceConfigurationOptionsResponse -->

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope"
    xmlns:SOAP-ENC="http://www.w3.org/2003/05/soap-encoding"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:c14n="http://www.w3.org/2001/10/xml-exc-c14n#"
    xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
    xmlns:ds="http://www.w3.org/2000/09/xmldsig#"
    xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
    xmlns:wsa5="http://www.w3.org/2005/08/addressing"
    xmlns:tt="http://www.onvif.org/ver10/schema"
    xmlns:wsnt="http://docs.oasis-open.org/wsn/b-2"
    xmlns:tns1="http://www.onvif.org/ver10/topics"
    xmlns:tnsaxis="http://www.axis.com/2009/event/topics"
    xmlns:tev="http://www.onvif.org/ver10/events/wsdl"
    xmlns:tr2="http://www.onvif.org/ver20/media/wsdl"
    xmlns:axt="http://www.onvif.org/ver20/analytics"
    xmlns:ter="http://www.onvif.org/ver10/error">
    <SOAP-ENV:Header></SOAP-ENV:Header>
    <SOAP-ENV:Body>
        <tr2:GetVideoSourceConfigurationOptionsResponse>
            <tr2:Options>
                <tt:BoundsRange>
                    <tt:XRange>
                        <tt:Min>0</tt:Min>
                        <tt:Max>0</tt:Max>
                    </tt:XRange>
                    <tt:YRange>
                        <tt:Min>0</tt:Min>
                        <tt:Max>0</tt:Max>
                    </tt:YRange>
                    <tt:WidthRange>
                        <tt:Min>3840</tt:Min>
                        <tt:Max>3840</tt:Max>
                    </tt:WidthRange>
                    <tt:HeightRange>
                        <tt:Min>2160</tt:Min>
                        <tt:Max>2160</tt:Max>
                    </tt:HeightRange>
                </tt:BoundsRange>
                <tt:VideoSourceTokensAvailable>0</tt:VideoSourceTokensAvailable>
                <tt:Extension>
                    <tt:Rotate>
                        <tt:Mode>ON</tt:Mode>
                        <tt:DegreeList>
                            <tt:Items>0</tt:Items>
                            <tt:Items>90</tt:Items>
                            <tt:Items>180</tt:Items>
                            <tt:Items>270</tt:Items>
                        </tt:DegreeList>
                    </tt:Rotate>
                </tt:Extension>
            </tr2:Options>
        </tr2:GetVideoSourceConfigurationOptionsResponse>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>